### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_app_service_virtual_network_swift_connection.azure_vnet_connection[0] has been deleted
-   resource "azurerm_app_service_virtual_network_swift_connection" "azure_vnet_connection" {
-       app_service_id = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Web/sites/demo-inf-dev-linux-appsvc" -> null
-       id             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Web/sites/demo-inf-dev-linux-appsvc/config/virtualNetwork" -> null
-       subnet_id      = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/App-Service-Integration-Subnet" -> null
    }

  # azurerm_application_insights.INSIGHTS has been deleted
-   resource "azurerm_application_insights" "INSIGHTS" {
-       app_id                                = "f6fbdeb6-a185-42e9-9c62-fdf357201787" -> null
-       application_type                      = "web" -> null
-       connection_string                     = (sensitive value)
-       daily_data_cap_in_gb                  = 100 -> null
-       daily_data_cap_notifications_disabled = false -> null
-       disable_ip_masking                    = false -> null
-       force_customer_storage_for_profiler   = false -> null
-       id                                    = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Insights/components/demo-inf-dev-insights" -> null
-       instrumentation_key                   = (sensitive value)
-       internet_ingestion_enabled            = true -> null
-       internet_query_enabled                = true -> null
-       local_authentication_disabled         = false -> null
-       location                              = "uksouth" -> null
-       name                                  = "demo-inf-dev-insights" -> null
-       resource_group_name                   = "Demo-Inf-Dev-Rg" -> null
-       retention_in_days                     = 90 -> null
-       sampling_percentage                   = 100 -> null
-       tags                                  = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
    }

  # azurerm_container_registry.ACR has been deleted
-   resource "azurerm_container_registry" "ACR" {
-       admin_enabled                 = false -> null
-       anonymous_pull_enabled        = false -> null
-       data_endpoint_enabled         = false -> null
-       encryption                    = [
-           {
-               enabled            = false
-               identity_client_id = ""
-               key_vault_key_id   = ""
            },
        ] -> null
-       export_policy_enabled         = true -> null
-       id                            = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.ContainerRegistry/registries/demoinfdevacr" -> null
-       location                      = "uksouth" -> null
-       login_server                  = "demoinfdevacr.azurecr.io" -> null
-       name                          = "demoinfdevacr" -> null
-       network_rule_bypass_option    = "AzureServices" -> null
-       network_rule_set              = [
-           {
-               default_action  = "Deny"
-               ip_rule         = [
-                   {
-                       action   = "Allow"
-                       ip_range = "183.44.33.0/24"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.56.240"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.56.251"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.57.227"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.110"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.123"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.125"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.128"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.158"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.163"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.165"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.173"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.177"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.178"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.200"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.205"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.211"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.214"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.108.58.75"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.90.71.111"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.90.71.139"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.90.71.146"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.90.71.54"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.90.71.64"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "20.90.71.69"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "51.104.28.79"
                    },
-                   {
-                       action   = "Allow"
-                       ip_range = "8.8.8.8"
                    },
                ]
-               virtual_network = [
-                   {
-                       action    = "Allow"
-                       subnet_id = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/App-Service-Integration-Subnet"
                    },
                ]
            },
        ] -> null
-       public_network_access_enabled = true -> null
-       quarantine_policy_enabled     = false -> null
-       resource_group_name           = "Demo-Inf-Dev-Rg" -> null
-       retention_policy              = [
-           {
-               days    = 7
-               enabled = false
            },
        ] -> null
-       sku                           = "Premium" -> null
-       tags                          = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
-       trust_policy                  = [
-           {
-               enabled = false
            },
        ] -> null
-       zone_redundancy_enabled       = false -> null

-       identity {
-           identity_ids = [] -> null
-           principal_id = "d66bd864-1ad0-4a6c-81c1-c8de06649c7f" -> null
-           tenant_id    = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2" -> null
-           type         = "SystemAssigned" -> null
        }
    }

  # azurerm_linux_web_app.APPSVC has been deleted
-   resource "azurerm_linux_web_app" "APPSVC" {
-       app_settings                      = (sensitive) -> null
-       client_affinity_enabled           = false -> null
-       client_certificate_enabled        = false -> null
-       client_certificate_mode           = "Required" -> null
-       custom_domain_verification_id     = (sensitive value)
-       default_hostname                  = "demo-inf-dev-linux-appsvc.azurewebsites.net" -> null
-       enabled                           = true -> null
-       https_only                        = true -> null
-       id                                = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Web/sites/demo-inf-dev-linux-appsvc" -> null
-       key_vault_reference_identity_id   = "SystemAssigned" -> null
-       kind                              = "app,linux,container" -> null
-       location                          = "uksouth" -> null
-       name                              = "demo-inf-dev-linux-appsvc" -> null
-       outbound_ip_address_list          = [
-           "20.108.56.240",
-           "20.108.58.75",
-           "20.108.58.110",
-           "20.108.58.123",
-           "20.108.58.125",
-           "20.108.58.128",
-           "51.104.28.79",
        ] -> null
-       outbound_ip_addresses             = "20.108.56.240,20.108.58.75,20.108.58.110,20.108.58.123,20.108.58.125,20.108.58.128,51.104.28.79" -> null
-       possible_outbound_ip_address_list = [
-           "20.108.56.240",
-           "20.108.58.75",
-           "20.108.58.110",
-           "20.108.58.123",
-           "20.108.58.125",
-           "20.108.58.128",
-           "20.108.56.251",
-           "20.108.58.158",
-           "20.108.58.163",
-           "20.108.58.165",
-           "20.108.58.173",
-           "20.108.58.177",
-           "20.108.58.178",
-           "20.108.58.200",
-           "20.108.58.205",
-           "20.108.57.227",
-           "20.108.58.211",
-           "20.108.58.214",
-           "20.90.71.54",
-           "20.90.71.64",
-           "20.90.71.69",
-           "20.90.71.111",
-           "20.90.71.139",
-           "20.90.71.146",
-           "51.104.28.79",
        ] -> null
-       possible_outbound_ip_addresses    = "20.108.56.240,20.108.58.75,20.108.58.110,20.108.58.123,20.108.58.125,20.108.58.128,20.108.56.251,20.108.58.158,20.108.58.163,20.108.58.165,20.108.58.173,20.108.58.177,20.108.58.178,20.108.58.200,20.108.58.205,20.108.57.227,20.108.58.211,20.108.58.214,20.90.71.54,20.90.71.64,20.90.71.69,20.90.71.111,20.90.71.139,20.90.71.146,51.104.28.79" -> null
-       resource_group_name               = "Demo-Inf-Dev-Rg" -> null
-       service_plan_id                   = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Web/serverfarms/demo-inf-dev-asp" -> null
-       site_credential                   = [
-           {
-               name     = "$demo-inf-dev-linux-appsvc"
-               password = "LC6jvJrfy1uFrCjYGNvGg8mDvylaDwZR2xgkEvhftjAeNHs1gCSiGEe44Di8"
            },
        ] -> null
-       tags                              = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null

-       auth_settings {
-           additional_login_parameters    = {} -> null
-           allowed_external_redirect_urls = [] -> null
-           enabled                        = false -> null
-           token_refresh_extension_hours  = 0 -> null
-           token_store_enabled            = false -> null
        }

-       identity {
-           identity_ids = [] -> null
-           principal_id = "d22de0ca-47a3-43ea-9051-37c989343866" -> null
-           tenant_id    = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2" -> null
-           type         = "SystemAssigned" -> null
        }

-       site_config {
-           always_on                               = true -> null
-           auto_heal_enabled                       = false -> null
-           container_registry_use_managed_identity = true -> null
-           default_documents                       = [
-               "Default.htm",
-               "Default.html",
-               "Default.asp",
-               "index.htm",
-               "index.html",
-               "iisstart.htm",
-               "default.aspx",
-               "index.php",
-               "hostingstart.html",
            ] -> null
-           detailed_error_logging_enabled          = false -> null
-           ftps_state                              = "FtpsOnly" -> null
-           health_check_eviction_time_in_min       = 0 -> null
-           http2_enabled                           = false -> null
-           ip_restriction                          = [] -> null
-           linux_fx_version                        = "DOCKER|demoinfdevacr.azurecr.io/demo-inf-dev-linux-appsvc:latest" -> null
-           load_balancing_mode                     = "LeastRequests" -> null
-           local_mysql_enabled                     = false -> null
-           managed_pipeline_mode                   = "Integrated" -> null
-           minimum_tls_version                     = "1.2" -> null
-           remote_debugging_enabled                = false -> null
-           remote_debugging_version                = "VS2019" -> null
-           scm_ip_restriction                      = [] -> null
-           scm_minimum_tls_version                 = "1.2" -> null
-           scm_type                                = "None" -> null
-           scm_use_main_ip_restriction             = false -> null
-           use_32_bit_worker                       = true -> null
-           vnet_route_all_enabled                  = true -> null
-           websockets_enabled                      = false -> null
-           worker_count                            = 1 -> null

-           application_stack {
-               docker_image     = "demoinfdevacr.azurecr.io/demo-inf-dev-linux-appsvc" -> null
-               docker_image_tag = "latest" -> null
            }
        }
    }

  # azurerm_network_security_group.NSG["App-Service-Integration-Subnet"] has been deleted
-   resource "azurerm_network_security_group" "NSG" {
-       id                  = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/App-Service-Integration-Subnet-nsg" -> null
-       location            = "uksouth" -> null
-       name                = "App-Service-Integration-Subnet-nsg" -> null
-       resource_group_name = "Demo-Inf-Dev-Rg" -> null
-       security_rule       = [] -> null
-       tags                = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
    }

  # azurerm_network_security_group.NSG["Subnet0"] has been deleted
-   resource "azurerm_network_security_group" "NSG" {
-       id                  = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/Subnet0-nsg" -> null
-       location            = "uksouth" -> null
-       name                = "Subnet0-nsg" -> null
-       resource_group_name = "Demo-Inf-Dev-Rg" -> null
-       security_rule       = [] -> null
-       tags                = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
    }

  # azurerm_network_security_group.NSG["Subnet1"] has been deleted
-   resource "azurerm_network_security_group" "NSG" {
-       id                  = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/Subnet1-nsg" -> null
-       location            = "uksouth" -> null
-       name                = "Subnet1-nsg" -> null
-       resource_group_name = "Demo-Inf-Dev-Rg" -> null
-       security_rule       = [] -> null
-       tags                = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
    }

  # azurerm_resource_group.RG has been deleted
-   resource "azurerm_resource_group" "RG" {
-       id       = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg" -> null
-       location = "uksouth" -> null
-       name     = "Demo-Inf-Dev-Rg" -> null
-       tags     = {} -> null
    }

  # azurerm_role_assignment.role_assigment has been deleted
-   resource "azurerm_role_assignment" "role_assigment" {
-       id                   = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.ContainerRegistry/registries/demoinfdevacr/providers/Microsoft.Authorization/roleAssignments/778d6272-19d8-35e6-d69b-6cd9e9d4b695" -> null
-       name                 = "778d6272-19d8-35e6-d69b-6cd9e9d4b695" -> null
-       principal_id         = "d22de0ca-47a3-43ea-9051-37c989343866" -> null
-       principal_type       = "ServicePrincipal" -> null
-       role_definition_id   = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
-       role_definition_name = "AcrPull" -> null
-       scope                = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.ContainerRegistry/registries/demoinfdevacr" -> null
    }

  # azurerm_service_plan.ASP has been deleted
-   resource "azurerm_service_plan" "ASP" {
-       id                           = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Web/serverfarms/demo-inf-dev-asp" -> null
-       kind                         = "linux" -> null
-       location                     = "uksouth" -> null
-       maximum_elastic_worker_count = 1 -> null
-       name                         = "demo-inf-dev-asp" -> null
-       os_type                      = "Linux" -> null
-       per_site_scaling_enabled     = false -> null
-       reserved                     = true -> null
-       resource_group_name          = "Demo-Inf-Dev-Rg" -> null
-       sku_name                     = "S1" -> null
-       tags                         = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
-       worker_count                 = 1 -> null
    }

  # azurerm_subnet.SUBNETS["App-Service-Integration-Subnet"] has been deleted
-   resource "azurerm_subnet" "SUBNETS" {
-       address_prefixes                               = [
-           "10.2.2.0/27",
        ] -> null
-       enforce_private_link_endpoint_network_policies = false -> null
-       enforce_private_link_service_network_policies  = false -> null
-       id                                             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/App-Service-Integration-Subnet" -> null
-       name                                           = "App-Service-Integration-Subnet" -> null
-       resource_group_name                            = "Demo-Inf-Dev-Rg" -> null
-       service_endpoint_policy_ids                    = [] -> null
-       service_endpoints                              = [
-           "Microsoft.ContainerRegistry",
        ] -> null
-       virtual_network_name                           = "Demo-Inf-Dev-Vnet" -> null

-       delegation {
-           name = "delegated-appservice" -> null

-           service_delegation {
-               actions = [
-                   "Microsoft.Network/virtualNetworks/subnets/action",
                ] -> null
-               name    = "Microsoft.Web/serverFarms" -> null
            }
        }
    }

  # azurerm_subnet.SUBNETS["Subnet0"] has been deleted
-   resource "azurerm_subnet" "SUBNETS" {
-       address_prefixes                               = [
-           "10.2.0.0/24",
        ] -> null
-       enforce_private_link_endpoint_network_policies = false -> null
-       enforce_private_link_service_network_policies  = false -> null
-       id                                             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet0" -> null
-       name                                           = "Subnet0" -> null
-       resource_group_name                            = "Demo-Inf-Dev-Rg" -> null
-       service_endpoint_policy_ids                    = [] -> null
-       service_endpoints                              = [] -> null
-       virtual_network_name                           = "Demo-Inf-Dev-Vnet" -> null
    }

  # azurerm_subnet.SUBNETS["Subnet1"] has been deleted
-   resource "azurerm_subnet" "SUBNETS" {
-       address_prefixes                               = [
-           "10.2.1.0/24",
        ] -> null
-       enforce_private_link_endpoint_network_policies = false -> null
-       enforce_private_link_service_network_policies  = false -> null
-       id                                             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet1" -> null
-       name                                           = "Subnet1" -> null
-       resource_group_name                            = "Demo-Inf-Dev-Rg" -> null
-       service_endpoint_policy_ids                    = [] -> null
-       service_endpoints                              = [] -> null
-       virtual_network_name                           = "Demo-Inf-Dev-Vnet" -> null
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["App-Service-Integration-Subnet"] has been deleted
-   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
-       id                        = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/App-Service-Integration-Subnet" -> null
-       network_security_group_id = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/App-Service-Integration-Subnet-nsg" -> null
-       subnet_id                 = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/App-Service-Integration-Subnet" -> null
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["Subnet0"] has been deleted
-   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
-       id                        = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet0" -> null
-       network_security_group_id = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/Subnet0-nsg" -> null
-       subnet_id                 = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet0" -> null
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["Subnet1"] has been deleted
-   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
-       id                        = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet1" -> null
-       network_security_group_id = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/Subnet1-nsg" -> null
-       subnet_id                 = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet1" -> null
    }

  # azurerm_virtual_network.VNET has been deleted
-   resource "azurerm_virtual_network" "VNET" {
-       address_space           = [
-           "10.2.0.0/16",
        ] -> null
-       dns_servers             = [] -> null
-       flow_timeout_in_minutes = 0 -> null
-       guid                    = "a5bcd271-a8bd-4992-bbc2-503e8a7b540b" -> null
-       id                      = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet" -> null
-       location                = "uksouth" -> null
-       name                    = "Demo-Inf-Dev-Vnet" -> null
-       resource_group_name     = "Demo-Inf-Dev-Rg" -> null
-       subnet                  = [
-           {
-               address_prefix = "10.2.0.0/24"
-               id             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet0"
-               name           = "Subnet0"
-               security_group = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/Subnet0-nsg"
            },
-           {
-               address_prefix = "10.2.1.0/24"
-               id             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/Subnet1"
-               name           = "Subnet1"
-               security_group = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/Subnet1-nsg"
            },
-           {
-               address_prefix = "10.2.2.0/27"
-               id             = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/virtualNetworks/Demo-Inf-Dev-Vnet/subnets/App-Service-Integration-Subnet"
-               name           = "App-Service-Integration-Subnet"
-               security_group = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.Network/networkSecurityGroups/App-Service-Integration-Subnet-nsg"
            },
        ] -> null
-       tags                    = {
-           "NewTag2" = "last2"
-           "Tag1"    = "first1"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_app_service_virtual_network_swift_connection.azure_vnet_connection[0] will be created
+   resource "azurerm_app_service_virtual_network_swift_connection" "azure_vnet_connection" {
+       app_service_id = (known after apply)
+       id             = (known after apply)
+       subnet_id      = (known after apply)
    }

  # azurerm_application_insights.INSIGHTS will be created
+   resource "azurerm_application_insights" "INSIGHTS" {
+       app_id                                = (known after apply)
+       application_type                      = "web"
+       connection_string                     = (sensitive value)
+       daily_data_cap_in_gb                  = (known after apply)
+       daily_data_cap_notifications_disabled = (known after apply)
+       disable_ip_masking                    = false
+       force_customer_storage_for_profiler   = false
+       id                                    = (known after apply)
+       instrumentation_key                   = (sensitive value)
+       internet_ingestion_enabled            = true
+       internet_query_enabled                = true
+       local_authentication_disabled         = false
+       location                              = "uksouth"
+       name                                  = "demo-inf-dev-insights"
+       resource_group_name                   = "Demo-Inf-Dev-Rg"
+       retention_in_days                     = 90
+       sampling_percentage                   = 100
    }

  # azurerm_container_registry.ACR will be created
+   resource "azurerm_container_registry" "ACR" {
+       admin_enabled                 = false
+       admin_password                = (sensitive value)
+       admin_username                = (known after apply)
+       encryption                    = (known after apply)
+       export_policy_enabled         = true
+       id                            = (known after apply)
+       location                      = "uksouth"
+       login_server                  = (known after apply)
+       name                          = "demoinfdevacr"
+       network_rule_bypass_option    = "AzureServices"
+       network_rule_set              = [
+           {
+               default_action  = "Deny"
+               ip_rule         = [
+                   {
+                       action   = (known after apply)
+                       ip_range = (known after apply)
                    },
                ]
+               virtual_network = [
+                   {
+                       action    = "Allow"
+                       subnet_id = (known after apply)
                    },
                ]
            },
        ]
+       public_network_access_enabled = true
+       resource_group_name           = "Demo-Inf-Dev-Rg"
+       retention_policy              = (known after apply)
+       sku                           = "Premium"
+       trust_policy                  = (known after apply)
+       zone_redundancy_enabled       = false

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }
    }

  # azurerm_linux_web_app.APPSVC will be created
+   resource "azurerm_linux_web_app" "APPSVC" {
+       app_settings                      = (sensitive)
+       client_affinity_enabled           = false
+       client_certificate_enabled        = false
+       client_certificate_mode           = "Required"
+       custom_domain_verification_id     = (sensitive value)
+       default_hostname                  = (known after apply)
+       enabled                           = true
+       https_only                        = true
+       id                                = (known after apply)
+       key_vault_reference_identity_id   = (known after apply)
+       kind                              = (known after apply)
+       location                          = "uksouth"
+       name                              = "demo-inf-dev-linux-appsvc"
+       outbound_ip_address_list          = (known after apply)
+       outbound_ip_addresses             = (known after apply)
+       possible_outbound_ip_address_list = (known after apply)
+       possible_outbound_ip_addresses    = (known after apply)
+       resource_group_name               = "Demo-Inf-Dev-Rg"
+       service_plan_id                   = (known after apply)
+       site_credential                   = (known after apply)

+       auth_settings {
+           additional_login_parameters    = (known after apply)
+           allowed_external_redirect_urls = (known after apply)
+           default_provider               = (known after apply)
+           enabled                        = (known after apply)
+           issuer                         = (known after apply)
+           runtime_version                = (known after apply)
+           token_refresh_extension_hours  = (known after apply)
+           token_store_enabled            = (known after apply)
+           unauthenticated_client_action  = (known after apply)

+           active_directory {
+               allowed_audiences          = (known after apply)
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
            }

+           facebook {
+               app_id                  = (known after apply)
+               app_secret              = (sensitive value)
+               app_secret_setting_name = (known after apply)
+               oauth_scopes            = (known after apply)
            }

+           github {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           google {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           microsoft {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           twitter {
+               consumer_key                 = (known after apply)
+               consumer_secret              = (sensitive value)
+               consumer_secret_setting_name = (known after apply)
            }
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = true
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           health_check_eviction_time_in_min       = (known after apply)
+           http2_enabled                           = false
+           ip_restriction                          = (known after apply)
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction                      = (known after apply)
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image     = "demoinfdevacr.azurecr.io/demo-inf-dev-linux-appsvc"
+               docker_image_tag = "latest"
            }
        }
    }

  # azurerm_network_security_group.NSG["App-Service-Integration-Subnet"] will be created
+   resource "azurerm_network_security_group" "NSG" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "App-Service-Integration-Subnet-nsg"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       security_rule       = (known after apply)
    }

  # azurerm_network_security_group.NSG["Subnet0"] will be created
+   resource "azurerm_network_security_group" "NSG" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "Subnet0-nsg"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       security_rule       = (known after apply)
    }

  # azurerm_network_security_group.NSG["Subnet1"] will be created
+   resource "azurerm_network_security_group" "NSG" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "Subnet1-nsg"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       security_rule       = (known after apply)
    }

  # azurerm_resource_group.RG will be created
+   resource "azurerm_resource_group" "RG" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "Demo-Inf-Dev-Rg"
    }

  # azurerm_role_assignment.role_assigment will be created
+   resource "azurerm_role_assignment" "role_assigment" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.ASP will be created
+   resource "azurerm_service_plan" "ASP" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "uksouth"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = "demo-inf-dev-asp"
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = "Demo-Inf-Dev-Rg"
+       sku_name                     = "S1"
+       worker_count                 = (known after apply)
    }

  # azurerm_subnet.SUBNETS["App-Service-Integration-Subnet"] will be created
+   resource "azurerm_subnet" "SUBNETS" {
+       address_prefixes                               = [
+           "10.2.2.0/27",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "App-Service-Integration-Subnet"
+       resource_group_name                            = "Demo-Inf-Dev-Rg"
+       service_endpoints                              = [
+           "Microsoft.ContainerRegistry",
        ]
+       virtual_network_name                           = "Demo-Inf-Dev-Vnet"

+       delegation {
+           name = "delegated-appservice"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
+                   "Microsoft.Network/virtualNetworks/subnets/join/action",
+                   "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
+                   "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet.SUBNETS["Subnet0"] will be created
+   resource "azurerm_subnet" "SUBNETS" {
+       address_prefixes                               = [
+           "10.2.0.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Subnet0"
+       resource_group_name                            = "Demo-Inf-Dev-Rg"
+       virtual_network_name                           = "Demo-Inf-Dev-Vnet"
    }

  # azurerm_subnet.SUBNETS["Subnet1"] will be created
+   resource "azurerm_subnet" "SUBNETS" {
+       address_prefixes                               = [
+           "10.2.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Subnet1"
+       resource_group_name                            = "Demo-Inf-Dev-Rg"
+       virtual_network_name                           = "Demo-Inf-Dev-Vnet"
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["App-Service-Integration-Subnet"] will be created
+   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["Subnet0"] will be created
+   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["Subnet1"] will be created
+   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.VNET will be created
+   resource "azurerm_virtual_network" "VNET" {
+       address_space       = [
+           "10.2.0.0/16",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "Demo-Inf-Dev-Vnet"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       subnet              = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```
</details>